app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::with(['user', 'category'])->latest()->get();
        $tags = Tag::all();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1, 3, 4, 5)
SELECT * FROM `tags`

    public function show(Post $post)
    {
        $tags = Tag::all();
---
SELECT * FROM `tags`

    public function interestgroup_show()
    {
        $tags = Tag::all();
        $posts = Post::with(['user', 'category'])->latest()->get();
---
SELECT * FROM `tags`
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3, 4, 5)

    public function create()
    {
        $categories = Category::all();
        $tags = Tag::all();
---
SELECT * FROM `categories`
SELECT * FROM `tags`

    public function store(Request $request)
    {
        $request->validate([
            'title' => 'required',
            'slug' => 'required',
            'category_id' => 'required',
            'content' => 'required',
        ]);

        $post = Post::create([
            'title' => $request->title,
            'slug' => $request->slug,
            'category_id' => $request->category_id,
            'user_id' => auth()->user()->id,
            'content' => $request->content,
        ]);

        if ($request->has('tags')) {
            $post->tag()->attach($request->tags);
---
INSERT INTO `posts` (`title`, `slug`, `category_id`, `user_id`, `content`, `updated_at`, `created_at`) VALUES ('Ternak sapo bagi kehidupan', 'ternak-sapo-bagi-kehidupan', '1', 1, '<p>&nbsp; Lorem ipsum d olor sit amet, <strong>consectetur adipisicing elit</strong>. Eius tenetur accusamus impedit sapiente iureomnis voluptas facilis, neque tempore repudiandae officia! Fugit quasi hic beatae sunt itaque quisquam suscipit atque. Placeat, cumque, possimus rerum officiis delectus necessitatibus dolorem quod aliquid,<br>&nbsp;</p><p>libero temporibus culpa cupiditate! <strong>Officia assumenda</strong> molestias numquam unde cumque, enim dolore eaque et minima sint, eveniet molestiae! Obcaecati sit, officiis id perferendis ipsa possimus explicabo esse quam quia? Illum nulla cupiditate modi, minima eius distinctio maxime voluptatem nobis inventore esse eligendi, magni eveniet veniam quasi ipsum omnis maiores laboriosam commodi mollitia soluta atque doloremque culpa. Harum repudiandae optio tempora.</p>', '2023-01-08 14:47:50', '2023-01-08 14:47:50')
INSERT INTO `post_tag` (`created_at`, `post_id`, `tag_id`, `updated_at`) VALUES ('2023-01-08 14:47:50', 11, '1', '2023-01-08 14:47:50'), ('2023-01-08 14:47:50', 11, '3', '2023-01-08 14:47:50')

    public function likePost($id)
    {
        $post = Post::find($id);
---
SELECT * FROM `posts` WHERE `posts`.`id` = '2' LIMIT 1

    public function edit(Post $post)
    {
        $categories = Category::all();
        $tags = Tag::all();
        $post = Post::with(['tag'])->where('id', $post->id)->first();
---
SELECT * FROM `categories`
SELECT * FROM `tags`
SELECT * FROM `posts` WHERE `id` = 16 LIMIT 1
SELECT `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id`, `post_tag`.`created_at` as `pivot_created_at`, `post_tag`.`updated_at` as `pivot_updated_at` FROM `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` WHERE `post_tag`.`post_id` in (16)

    public function destroy(Post $post)
    {
        $post->delete();
---
DELETE FROM `posts` WHERE `id` = 8