app/Http/Controllers/TagController.php

SELECT * FROM `posts` WHERE exists (SELECT * FROM `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` WHERE `posts`.`id` = `post_tag`.`post_id` and `slug` = 'pakan-ternak')
---
    public function show(Tag $tag)
    {
        $posts = Post::whereHas('tag', function($query) use ($tag) {
            $query->where('slug', $tag->slug);
        })->get();