app/Http/Controllers/UserController.php

    public function show()
    {
        $posts = Post::with(['user', 'category'])->where('user_id', auth()->user()->id)->latest()->get();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` WHERE `user_id` = 1 ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1)

    public function showSpecific(User $user)
    {
        $posts = Post::with(['user', 'category'])->where('user_id', $user->id)->latest()->get();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` WHERE `user_id` = 2 ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (2)

    public function update(Request $request)
    {
        $validated = $request->validate([
            'name' => ['string', 'max:255', 'required'],
            'username' => ['string', 'max:255', 'required'],
            'work_place' => ['string', 'max:255'],
            'job_position' => ['string', 'max:255'],
            'email' => ['email', 'max:255', 'required'],
            'avatar' => ['image', 'file', 'max:2048'],
        ]);

        if ($request->file('avatar')) {
            Storage::delete($request->user()->avatar);
            $validated['avatar'] = $request->file('avatar')->store('post-images');
        }

        User::where('id', $request->user()->id)->update($validated);
---
UPDATE `users` SET `name` = 'Aaliya Stenya', `username` = 'stenya_', `work_place` = 'Chevalier Lab SAS', `job_position` = 'Content Creator', `email` = 'aaa@gmail.com', `avatar` = 'post-images/AKHx35Ocyva5W4JofFPOFp62UhfFksC1hfs1K1zW.jpg', `users`.`updated_at` = '2023-01-03 14:12:33' WHERE `id` = 2